Terraform Plan Result:

## Terraform Plan Output

```terraform
[0m[1maws_vpc.demo_vpc_lt_20240622: Refreshing state... [id=vpc-02cdbcf6458c22bcd][0m
[0m[1maws_internet_gateway.demo_lt_igw: Refreshing state... [id=igw-0ef9503c36a5e9de6][0m
[0m[1maws_security_group.demo_lt_public_sg: Refreshing state... [id=sg-0b5980354bd496a33][0m
[0m[1maws_subnet.demo_public_subnet_1a_lt_20240622: Refreshing state... [id=subnet-081eb14d5b9023ec7][0m
[0m[1maws_route_table.demo_lt_public_rtb: Refreshing state... [id=rtb-0667f4d07fcba034e][0m
[0m[1maws_security_group_rule.demo_lt_public_sg_in_http: Refreshing state... [id=sgrule-1387891202][0m
[0m[1maws_route_table_association.demo_lt_public_rtb_ass_a: Refreshing state... [id=rtbassoc-04fd425d5bde64bb0][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_security_group_rule.demo_lt_public_sg_in_https[0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "demo_lt_public_sg_in_https" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = "sg-0b5980354bd496a33"
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1maws_security_group_rule.demo_lt_public_sg_in_https: Creating...[0m[0m
[0m[1maws_security_group_rule.demo_lt_public_sg_in_https: Creation complete after 1s [id=sgrule-2574792951][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m
```